_Rarzrabotki/Kazna/DataProcessors/ЗагрузкаКурсовВалютНБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаКурсовВалютНБУ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Kazna/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/DataProcessors/ЗагрузкаКурсовВалютНБУ/Ext/ObjectModule.bsl
Процедура ЗагрузитьКурсыССайтаНБУ(ДатаНач,ДатаКон) Экспорт
	Если НЕ ЗначениеЗаполнено(ДатаНач) ИЛИ НЕ ЗначениеЗаполнено(ДатаКон) Тогда
		Возврат;
	КонецЕсли;
	//**НТТР = Новый HTTPСоединение("bank.gov.ua");
	НТТР = Новый HTTPСоединение("bank.gov.ua",,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	ЗаголовкиHTTP = Новый Соответствие;
    RegExp = Новый COMОбъект("VBScript.RegExp");
    RegExp.IgnoreCase 	= Истина; //Игнорировать регистр
    RegExp.Global 		= Истина; //Поиск всех вхождений шаблона
    RegExp.MultiLine 	= Истина; //Многострочный режим
	ШаблонДляДатыУстановленияКурса =  ".*title_info[\s\S]*?<td class=""date"">[\s\S]*?(\d{1,2}\.\d{1,2}\.\d{4})[\s\S]*?</td>";
	
	ДатаЗагрузки = НачалоДня(ДатаНач)-86400;
	
    Пока ДатаЗагрузки <= ДатаКон Цикл
		
		#Если Клиент Тогда
		ОбработкаПрерыванияПользователя();
		#КонецЕсли
		
		Если ДатаЗагрузки < Дата(2015,01,01) Тогда
			#Если Клиент Тогда
			Сообщить("Обработка не позволяет загружать курсы до 01.01.2015");	
			Возврат;
			#КонецЕсли	
			ДатаЗагрузки = ДатаЗагрузки+60*60*24;
			Продолжить;
		КонецЕсли;
		
		СтрокаДата = Формат(ДатаЗагрузки,"ДФ=dd.MM.yyyy");
	//	ОтветHTTP = НТТР.Получить(Новый HTTPЗапрос("/control/uk/curmetal/currency/search?formType=searchFormDate&time_step=daily&date="+СтрокаДата, ЗаголовкиHTTP));
		//**ОтветHTTP = НТТР.Получить(Новый HTTPЗапрос("/markets/exchangerates/?date="+СтрокаДата+"&period=daily", ЗаголовкиHTTP));
		ОтветHTTP = НТТР.Получить(Новый HTTPЗапрос("/ua/markets/exchangerates/?date="+СтрокаДата+"&period=daily", ЗаголовкиHTTP));
		ТекстОтвета = ОтветHTTP.ПолучитьТелоКакСтроку();

		//Курс USD
		НаименованиеВалюты="USD";
		ШаблонДляКурса = ".*Офіційний курс[\s\S]*?<td.*"+НаименованиеВалюты+"[\s\S]*?<td[\s\S]*?>(.*)<\/td>.*\n.*<\/tr>[\s\S]*Зручний експорт*";
        Курс = ПрименитьРегулярку(RegExp,ТекстОтвета,ШаблонДляКурса);
		
		ШаблонДляКратности = ".*Офіційний курс[\s\S]*?<td.*"+НаименованиеВалюты+"[\s\S]*?<td data-label=.Кількість одиниць валюти.>(.*)<\/td>";
		Кратность = ПрименитьРегулярку(RegExp,ТекстОтвета,ШаблонДляКратности);
		Если Кратность<>100 тогда 
			Курс= Курс*100/Кратность;
		КонецЕсли;
        ЗаписьКурса("840",100,Курс,ДатаЗагрузки);
				
		//Курс EUR
		НаименованиеВалюты="EUR";
		ШаблонДляКурса = ".*Офіційний курс[\s\S]*?<td.*"+НаименованиеВалюты+"[\s\S]*?<td[\s\S]*?>(.*)<\/td>.*\n.*<\/tr>[\s\S]*Зручний експорт*";
        Курс = ПрименитьРегулярку(RegExp,ТекстОтвета,ШаблонДляКурса);
		
		ШаблонДляКратности = ".*Офіційний курс[\s\S]*?<td.*"+НаименованиеВалюты+"[\s\S]*?<td data-label=.Кількість одиниць валюти.>(.*)<\/td>";
		Кратность = ПрименитьРегулярку(RegExp,ТекстОтвета,ШаблонДляКратности);
		Если Кратность<>100 тогда 
			Курс= Курс*100/Кратность;
		КонецЕсли;
        ЗаписьКурса("978",100,Курс,ДатаЗагрузки);

		
		////Курс RUB
		//НаименованиеВалюты="RUB";
		//ШаблонДляКурса = ".*Офіційний курс[\s\S]*?<td.*"+НаименованиеВалюты+"[\s\S]*?<td[\s\S]*?>(.*)<\/td>.*\n.*<\/tr>[\s\S]*Зручний експорт*";
		//Курс = ПрименитьРегулярку(RegExp,ТекстОтвета,ШаблонДляКурса);
		//
		//ШаблонДляКратности = ".*Офіційний курс[\s\S]*?<td.*"+НаименованиеВалюты+"[\s\S]*?<td data-label=.Кількість одиниць.>(.*)<\/td>";
		//ШаблонДляКратности = ".*Офіційний курс[\s\S]*?<td.*"+НаименованиеВалюты+"[\s\S]*?<td data-label=.Кількість одиниць валюти.>(.*)<\/td>";
		//Кратность = ПрименитьРегулярку(RegExp,ТекстОтвета,ШаблонДляКратности);
		//Если Кратность<>100 тогда 
		//	Курс= Курс*100/Кратность;
		//КонецЕсли;
		//ЗаписьКурса("643",100,Курс,ДатаЗагрузки);
		//
		ДатаЗагрузки = ДатаЗагрузки+60*60*24;
	КонецЦикла;
	

КонецПроцедуры




Функция ПрименитьРегулярку(РегЭксп,Данные,Шаблон)
	Ответ = "";
	РегЭксп.Pattern = Шаблон;
	Matches = РегЭксп.Execute(Данные);
    ЧислоВхождений=Matches.Count();
	Для Каждого Совпадение Из Matches Цикл
		Подстроки = Совпадение.SubMatches;
		ЧислоПодстрок = Подстроки.Count();
		Для Каждого Подстрока Из Подстроки Цикл
			Ответ=Ответ+Подстрока;
		КонецЦикла;    
	КонецЦикла;
	
	//используем регулярки для получения только одного значения.
	Если ЧислоВхождений=1 И ЧислоПодстрок=1 Тогда
		Возврат Ответ;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ЗаписьКурса(КодВалюты,КратностьВалюты,КурсВалюты,ДатаКурса)
	
	Валюта = Справочники.Валюты.НайтиПоКоду(КодВалюты);
	Если КурсВалюты=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегистрКурсыВалют = РегистрыСведений.КурсыВалют;
	ЗаписьКурсовВалют = РегистрКурсыВалют.СоздатьМенеджерЗаписи();
	ЗаписьКурсовВалют.Валюта = Валюта;
	
	
	ЗаписьКурсовВалют.Период = ДатаКурса;
	
	ЗаписьКурсовВалют.Прочитать();
	Если ЗаписьКурсовВалют.Курс <> Число(КурсВалюты) Тогда 
		ЗаписьКурсовВалют.Валюта    = Валюта;
		ЗаписьКурсовВалют.Период    = ДатаКурса;
		ЗаписьКурсовВалют.Курс      = КурсВалюты/1;
		ЗаписьКурсовВалют.Кратность = КратностьВалюты;
		ЗаписьКурсовВалют.Записать();
		#Если Клиент Тогда
			Сообщить("Курс "+Валюта+", "+Формат(ДатаКурса,"ДФ=dd.MM.yyyy")+" равен "+КурсВалюты+".",СтатусСообщения.Информация);
		#КонецЕсли
	КонецЕсли;

КонецПроцедуры
